app/Comment.php

select sum(`up`) as aggregate from `votes` where `votes`.`comment_id` = 1 and `votes`.`comment_id` is not null
---
    public function getUpCountAttribute(){
        return (int) $this->votes()->sum('up');

select sum(`down`) as aggregate from `votes` where `votes`.`comment_id` = 1 and `votes`.`comment_id` is not null
---
    public function getDownCountAttribute(){
        return (int) $this->votes()->sum('down');