app/Http/Controllers/ArticlesController.php

    public function index(Request $request , $slug = null)
    {


       $cacheKey = cache_key('articles.index');


        $query = $slug
            ? \App\Tag::whereSlug($slug)->firstOrFail()->articles()
---
select * from `tags` where `slug` = 'general' limit 1

    public function show(\App\Article $article)
    {
     //  $article = \App\Article::findOrFail($id);
      //  debug($article->toArray());




        $comments = $article->comments()->with('replies')->whereNull('parent_id')->latest()->get();
---
select * from `comments` where `comments`.`parent_id` in (1) and `comments`.`deleted_at` is null order by `created_at` desc