app/Http/Controllers/PasswordsController.php

    public function postRemind(Request $request){
        $this->validate($request,['email'=>'required|email|exists:users']);

        $email = $request->get('email');
        $token = str_random(64);

        \DB::table('password_resets')->insert([
            'email' => $email,
            'token' => $token,
            'created_at' => \Carbon\Carbon::now()->toDateTimeString()
        ]);
---
insert into `password_resets` (`email`, `token`, `created_at`) values ('joonthy@gmail.com', 'FaDbkQLr8kGzwIDKII5566xjx2JFV5FBQBrmqzrSHsjBA99sltg9rA1DDm48opjh', '2019-07-28 12:32:33')

    public function postReset(Request $request){
        $this->validate($request,[
            'email' => 'required|email|exists:users',
            'password' => 'required|confirmed',
            'token' => 'required',
        ]);

        $token = $request->get('token');

        if(! \DB::table('password_resets')->whereToken($token)->first()){
            flash('URL이 정확하지 않습니다.');

            return back()->withInput();
        }

        \App\User::whereEmail($request->input('email'))->first()->update([
           'password' => bcrypt($request ->input('password'))
        ]);

        \DB::table('password_resets')->whereToken($token)->delete();
---
select * from `password_resets` where `token` = 'VwdWfoX004h6g0L1wk9UXh9aWDpyy2D4mbPvny7ViN34IHnOxwMaEB02jn9gsrUA' limit 1
select * from `users` where `email` = 'joonthy@gmail.com' limit 1
update `users` set `password` = 'y$xwXZplHrCptkttJDn.Uwp.kH6SDw9Y8.Yq8dGznsLi57uTnYLkzYO', `updated_at` = '2019-07-28 12:37:31' where `id` = 6
delete from `password_resets` where `token` = 'VwdWfoX004h6g0L1wk9UXh9aWDpyy2D4mbPvny7ViN34IHnOxwMaEB02jn9gsrUA'