app/Http/Controllers/SocialController.php

    protected function handleProviderCallback($provider){
        $user = \Socialite::driver($provider)->user();

        $user = (\App\User::whereEmail($user->getEmail())->first())
---
select * from `users` where `email` = 'joonthy@gmail.com' limit 1