app/Http/Controllers/UsersController.php

update `users` set `name` = 'joon', `password` = 'y$rUJnuho.xnowj4FL8TuU/eqV3BQ7B.G55yfhbTfIYeQ/dW9j0OMoS', `updated_at` = '2019-07-28 12:18:20' where `id` = 6
---
   protected function updateSocialAccount (Request $request, \App\User $user){
        $this->validate($request,[
            'name' => 'required|max:255',
            'email' => 'required|email|max:255',
            'password' => 'required|confirmed|min:6',
        ]);

        $user ->update([
           'name' => $request ->input('name'),
           'password' => bcrypt($request->input('password')),
        ]);