app/Providers/AppServiceProvider.php

select * from `tags`
---
    public function boot()
    {
        view()->composer('*',function($view){
           $allTags = \Cache::rememberForever('tags.list',function (){
               return \App\Tag::all();
           });